app/channels/room_channel.rb

INSERT INTO "messages" ("content", "created_at", "updated_at", "user_id", "room_id") VALUES (?, ?, ?, ?, ?)  [["content", "a"], ["created_at", "2020-06-15 10:05:51.542404"], ["updated_at", "2020-06-15 10:05:51.542404"], ["user_id", 1], ["room_id", 1]]
---
  def speak(data)
    message = Message.new(content: data['message'][0], user_id: data['message'][1].to_i, room_id: data['message'][2].to_i)
    message.save