app/views/posts/index2.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 2]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <%= follow_user.name %>
        <% @like = Like.where(user_id: follow_user) %>
        <% @like.each do |like| %>
          <% post = Post.find_by(id: like.post_id) %>