app/views/posts/show.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 2], ["post_id", 1], ["LIMIT", 1]]
---
        <% if @likes_user_count < 5 %>
          <% if Like.find_by(user_id: current_user.id, post_id: @post.id) %>