app/controllers/home_controller.rb

  def top
    if user_signed_in?
      @room = Room.new
      @rooms = current_user.rooms
      @nonrooms = Room.where(id: UserRoom.where.not(user_id: current_user.id).pluck(:id))
---
SELECT "user_rooms"."id" FROM "user_rooms" WHERE "user_rooms"."user_id" != ?  [["user_id", 1]]