app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @posts_all = Post.includes(:user,:taggings,:like_users,:likes)

    @user = User.find(current_user.id)

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 2]]
---
  def index2
    @posts_all = Post.includes(:user,:taggings,:like_users,:likes)

    @user = User.find(current_user.id)

    @follow_users = @user.following_user.all

    @likes = Like.where(user_id: @follow_users).order("created_at DESC").page(params[:page]).per(10)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 2]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 1]]
---
  def show
    @post = Post.find_by(id: params[:id])
    @user = @post.user
    @likes_count = Like.where(post_id: @post.id).count
    @likes_user_count = Like.where(user_id: current_user.id).count

INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "にゃんにゃん♡"], ["created_at", "2020-06-20 14:05:11.035733"], ["updated_at", "2020-06-20 14:05:11.035733"], ["user_id", 1]]
---
  def create
    @post = Post.new(content: params[:content], user_id: current_user.id)
    if @post.save