app/controllers/rooms_controller.rb

  def top
    if user_signed_in?
      @room = Room.new
      @rooms = current_user.rooms
      @nonrooms = Room.where(id: UserRoom.where.not(user_id: current_user.id).pluck(:id))
---
SELECT "user_rooms"."id" FROM "user_rooms" WHERE "user_rooms"."user_id" != ?  [["user_id", 1]]

  def create
    @room = Room.new(room_params)
    @room.save
    current_user.user_rooms.create(room_id: @room.id)
---
INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "宅まり"], ["created_at", "2020-05-23 05:49:12.342544"], ["updated_at", "2020-05-23 05:49:12.342544"]]
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["room_id", 1], ["created_at", "2020-05-23 05:49:12.424312"], ["updated_at", "2020-05-23 05:49:12.424312"]]