app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (content LIKE '%a%')
---
  def search
    @users = User.search(params[:search])