app/views/layouts/application.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
          <ul class="header-menus">
            <% if Post.find_by(user_id: current_user.id) == nil %>